{
    "terms": [
      {
        "names": ["si", "sistema de informacion", "sistemas de informacion"],
        "displayName": "SI",
        "definition": "<b>Sistema de Información</b> - Conjunto de elementos interrelacionados que recopilan, procesan, almacenan y distribuyen información para facilitar la toma de decisiones en las organizaciones. Puede ser manual o automatizado. <ul><li><b>Objetivo:</b> Apoyar la toma de decisiones.</li><li><b>Actividades:</b> Entrada, procesamiento, salida y retroalimentación de datos.</li><li><b>Recursos:</b> Tecnológicos, humanos, económicos, insumos, infraestructura y logísticos.</li><li><b>Ambiente:</b> Factores externos como clientes, regulaciones y otros sistemas.</li><li><b>Clasificación:</b> [[mis|MIS]], [[tps|TPS]], [[dss|DSS]].</li><li>Relacionado: [[desarrollo_si|Desarrollo de SI]]</li></ul> "
      },
      {
        "names": ["tps", "sistema transaccional", "sistemas transaccionales"],
        "displayName": "TPS",
        "definition": "<b>Sistemas Transaccionales</b> (Transaction Processing Systems) - Sistemas informáticos diseñados para registrar, procesar y almacenar las transacciones rutinarias de una organización. <ul><li><b>Enfoque:</b> Nivel operativo.</li><li><b>Funciones:</b> Registrar, almacenar y procesar transacciones básicas como ventas, compras y sueldos.</li><li><b>Características de las transacciones:</b> Operaciones individuales, breves e indivisibles con identificador único, fecha, hora, origen y ubicación.</li><li><b>Componentes:</b> Hardware, software, bases de datos, personal, telecomunicaciones y procedimientos operativos.</li><li><b>Objetivos:</b> Procesar grandes volúmenes de datos con precisión, asegurar integridad y calidad, reducir burocracia, generar informes, mejorar eficiencia del personal, y brindar soporte a sistemas como [[mis|MIS]], [[dss|DSS]], y ERP.</li><li><b>Pasos del procesamiento:</b> Captura de datos, validación, procesamiento, actualización de bases de datos, emisión de comprobantes.</li><li><b>Modos de procesamiento:</b> Por lotes, en línea, entrada en línea con procesamiento diferido.</li><li><b>Áreas funcionales:</b> Finanzas, ventas, logística, recursos humanos.</li><li><b>Ejemplos:</b> Procesamiento de pedidos y compras.</li></ul> Ver también [[si|Sistema de Información]]."
      },
      {
        "names": ["mis", "sistema de informacion gerencial", "sistemas de informacion gerencial"],
        "displayName": "MIS",
        "definition": "<b>Sistemas de Información Gerencial</b> - Brindan información estructurada y periódica para apoyar decisiones tácticas en mandos intermedios. <ul><li><b>Usuarios:</b> Mandos medios o gerenciales.</li><li><b>Tipo de información:</b> Informes periódicos, reportes agregados.</li><li><b>Objetivo:</b> Facilitar decisiones tácticas.</li></ul> Ver también [[si|Sistema de Información]]."
      },
      {
        "names": ["dss", "sistema de soporte a decisiones", "sistemas de soporte a decisiones"],
        "displayName": "DSS",
        "definition": "<b>Sistemas de Soporte a Decisiones</b> - Ayudan en la toma de decisiones estratégicas no estructuradas, utilizando datos tanto internos como externos. <ul><li><b>Enfoque:</b> Decisiones no rutinarias.</li><li><b>Fuentes de datos:</b> Internas y externas.</li><li><b>Herramientas:</b> Modelos analíticos, simulaciones, sistemas expertos.</li></ul> Ver también [[si|Sistema de Información]]."
      },
      {
        "names": ["ingenieria_software", "ingenieria del software", "ingeniería del software"],
        "displayName": "Ingeniería del Software",
        "definition": "Disciplina que aplica principios, metodologías y herramientas rigurosas para garantizar un desarrollo organizado, eficiente y de calidad del software. <ul><li><b>Objetivo:</b> Controlar el proceso de desarrollo.</li><li><b>Beneficios:</b> Mejora la calidad, reduce errores y facilita mantenimiento.</li><li><b>Aplicaciones:</b> Metodologías tradicionales y ágiles.</li></ul> Ver también [[desarrollo_si|Desarrollo de SI]]."
      },
      {
        "names": ["desarrollo_si", "desarrollo de si", "desarrollo de sistemas de informacion"],
        "displayName": "Desarrollo de SI",
        "definition": "Proceso estructurado de creación de un [[si|sistema de información]], incluyendo etapas como investigación, análisis, diseño, implementación y mantenimiento. <ul><li><b>Fases:</b> Investigación, análisis, diseño, implementación y mantenimiento.</li><li><b>Metodologías:</b> Tradicionales (cascada) y ágiles (scrum, XP).</li><li><b>Objetivo:</b> Alinear el sistema con los requerimientos del usuario y de la organización.</li><li>Participantes: [[desarrollo_si_participantes|Participantes]]</li></ul> Ver también [[ingenieria_software|Ingeniería del Software]]."
      },
      {
        "names": ["desarrollo_si_participantes", "participantes del desarrollo de si", "participantes del desarrollo de sistemas de informacion"],
        "displayName": "Participantes del Desarrollo de SI",
        "definition": "Personas y roles clave que intervienen en las distintas fases del desarrollo de un sistema de información. <ul><li><b>Clientes o administradores:</b> Definen objetivos y proveen recursos.</li><li><b>Líder de proyecto:</b> Coordina, planifica y controla el desarrollo.</li><li><b>Analistas:</b> Identifican requerimientos funcionales, procesos y documentación.</li><li><b>Diseñadores:</b> Traducen modelos lógicos a soluciones técnicas.</li><li><b>Programadores:</b> Codifican el sistema.</li><li><b>Testers:</b> Verifican que el sistema cumpla con los requerimientos.</li><li><b>Entrenadores:</b> Capacitan a los usuarios finales.</li></ul> Ver también [[desarrollo_si|Desarrollo de SI]]."
      }
    ]
  }