{
    "terms": [
      {
        "names": ["si", "sistema de informacion", "sistemas de informacion"],
        "displayName": "SI",
        "definition": "<b>Sistema de Información</b> - Conjunto de elementos interrelacionados que recopilan, procesan, almacenan y distribuyen información para facilitar la toma de decisiones en las organizaciones. Puede ser manual o automatizado. <ul><li><b>Objetivo:</b> Apoyar la toma de decisiones.</li><li><b>Actividades:</b> Entrada, procesamiento, salida y retroalimentación de datos.</li><li><b>Recursos:</b> Tecnológicos, humanos, económicos, insumos, infraestructura y logísticos.</li><li><b>Ambiente:</b> Factores externos como clientes, regulaciones y otros sistemas.</li><li><b>Clasificación:</b> [[mis|MIS]], [[tps|TPS]], [[dss|DSS]].</li><li>Relacionado: [[desarrollo_si|Desarrollo de SI]]</li></ul>"
      },
      {
        "names": ["tps", "sistema transaccional", "sistemas transaccionales"],
        "displayName": "TPS",
        "definition": "<b>Sistemas Transaccionales</b> (Transaction Processing Systems) - Sistemas informáticos diseñados para registrar, procesar y almacenar las transacciones rutinarias de una organización. <ul><li><b>Enfoque:</b> Nivel operativo.</li><li><b>Funciones:</b> Registrar, almacenar y procesar transacciones básicas como ventas, compras y sueldos.</li><li><b>Características de las transacciones:</b> Operaciones individuales, breves e indivisibles con identificador único, fecha, hora, origen y ubicación.</li><li><b>Componentes:</b> Hardware, software, bases de datos, personal, telecomunicaciones y procedimientos operativos.</li><li><b>Objetivos:</b> Procesar grandes volúmenes de datos con precisión, asegurar integridad y calidad, reducir burocracia, generar informes, mejorar eficiencia del personal, y brindar soporte a sistemas como [[mis|MIS]], [[dss|DSS]], y [[erp|ERP]].</li><li><b>Pasos del procesamiento:</b> Captura de datos, validación, procesamiento, actualización de bases de datos, emisión de comprobantes.</li><li><b>Modos de procesamiento:</b> Por lotes, en línea, entrada en línea con procesamiento diferido.</li><li><b>Áreas funcionales:</b> Finanzas, ventas, logística, recursos humanos.</li><li><b>Ejemplos:</b> Procesamiento de pedidos y compras.</li></ul> Ver también [[si|Sistema de Información]]."
      },
      {
        "names": ["mis", "sistema de informacion gerencial", "sistemas de informacion gerencial"],
        "displayName": "MIS",
        "definition": "<b>Sistemas de Información Gerencial</b> - Brindan información estructurada y periódica para apoyar decisiones tácticas en mandos intermedios. <ul><li><b>Usuarios:</b> Mandos medios o gerenciales.</li><li><b>Objetivo:</b> <ul><li>Facilitar decisiones tácticas</li><li>apoyar la gestión eficiente de recursos</li><li>brindar retroalimentación sobre la operatoria diaria</li><li>proveer información consolidada y estructurada para la [[toma_decisiones|toma de decisiones]]</li><li>monitorear el cumplimiento de [[objetivos_organizacionales|objetivos organizacionales]].</li></ul></li><li><b>Entradas:</b><ul><li><b>Fuentes Internas</b> como [[tps|TPS]]</li><li><b>fuentes externas</b> como clientes, proveedores, accionistas y competencia.</li></ul></li><li><b>Salidas:</b><ul><li><b>Reportes calendarizados:</b> se producen de forma periódica (diarios, semanales, mensuales).</li><li><b>Reportes por indicador clave:</b> resumen de actividades críticas recientes.</li><li><b>Reportes a pedido:</b> generados a solicitud específica del usuario.</li><li><b>Reportes de excepción:</b> emitidos ante eventos o desviaciones inusuales.</li><li><b>Reportes drill-down:</b> permiten profundizar desde información general hasta el detalle específico.</li></ul><b>Características clave:</b> <ul><li>Integración de datos de múltiples fuentes</li><li>personalización de reportes según el perfil del usuario</li><li>soporte para decisiones tácticas y estratégicas</li><li>automatización y repetitividad en la generación de información.</li></ul></li><li><b>Importancia:</b> Permite análisis históricos, comparación de datos, análisis de tendencias y ajustes estratégicos, convirtiéndose en herramienta esencial para la <b>eficiencia operativa y el cumplimiento de metas organizacionales.</b></li><li>Ver también [[si|Sistema de Información]].</li></ul> "
      },
      {
        "names": ["dss", "sistema de apoyo a la toma de decisiones", "sistemas de apoyo a la toma de decisiones"],
        "displayName": "DSS",
        "definition": "<b>Sistema de Apoyo a la Toma de Decisiones</b> (Decision Support System) - Sistema interactivo basado en computadora que combina datos, modelos analíticos y herramientas para ayudar en decisiones complejas, especialmente no estructuradas. <ul><li><b>Componentes:</b> Base de datos, base de modelos, interfaz de usuario y tomador de decisiones.</li><li><b>Características:</b> Flexible, adaptable, permite simulaciones y análisis 'qué pasaría si', usa datos internos y externos, soporta minería de datos y algoritmos heurísticos.</li><li><b>Capacidades:</b> Apoya la resolución de problemas en fases de inteligencia, diseño, elección, implementación y monitoreo; soporta decisiones ad hoc e institucionales; y problemas estructurados y no estructurados a nivel operativo, táctico y estratégico.</li><li><b>Objetivos:</b> Apoyar el juicio humano, fomentar la creatividad y permitir la exploración libre de alternativas.</li><li>Soporte para Multiple Niveles Organizacionales<ul><li>Operativos: Decisiones Diarias</li><li>Tactico: Planificacion y control</li><li>Estrategico: Decisiones de largo plazo</li></ul></li><li>Ver también [[si|Sistema de Información]], [[mis|MIS]], [[tps|TPS]].</li></ul>"
      },
      {
        "names": ["objetivos_organizacionales", "cumplimiento de objetivos organizacionales"],
        "displayName": "Objetivos Organizacionales",
        "definition": "Metas establecidas por una organización para guiar sus actividades y medir su éxito. El [[mis|MIS]] contribuye al monitoreo del cumplimiento de estos objetivos mediante reportes y análisis periódicos."
      },
      {
        "names": ["reportes_indicador_clave", "reportes por indicador clave"],
        "displayName": "Reportes por Indicador Clave",
        "definition": "Reportes generados por el [[mis|MIS]] que resumen actividades críticas recientes vinculadas a indicadores clave de desempeño (KPI)."
      },
      {
        "names": ["reportes_pedido", "reportes a pedido"],
        "displayName": "Reportes a Pedido",
        "definition": "Reportes generados por el [[mis|MIS]] en respuesta a solicitudes específicas de los usuarios para cubrir necesidades puntuales de información."
      },
      {
        "names": ["ingenieria_software", "ingenieria del software", "ingeniería del software"],
        "displayName": "Ingeniería del Software",
        "definition": "Disciplina que aplica principios, metodologías y herramientas rigurosas para garantizar un desarrollo organizado, eficiente y de calidad del software. <ul><li><b>Objetivo:</b> Controlar el proceso de desarrollo.</li><li><b>Beneficios:</b> Mejora la calidad, reduce errores y facilita mantenimiento.</li><li><b>Aplicaciones:</b> Metodologías tradicionales y ágiles.</li></ul> Ver también [[desarrollo_si|Desarrollo de SI]]."
      },
      {
        "names": ["desarrollo_si", "desarrollo de si", "desarrollo de sistemas de informacion"],
        "displayName": "Desarrollo de SI",
        "definition": "Proceso estructurado de creación de un [[si|sistema de información]], incluyendo etapas como investigación, análisis, diseño, implementación y mantenimiento. <ul><li><b>Fases:</b> Investigación, análisis, diseño, implementación y mantenimiento.</li><li><b>Metodologías:</b> Tradicionales (cascada) y ágiles (scrum, XP).</li><li><b>Objetivo:</b> Alinear el sistema con los requerimientos del usuario y de la organización.</li><li>Participantes: [[desarrollo_si_participantes|Participantes]]</li></ul> Ver también [[ingenieria_software|Ingeniería del Software]]."
      },
      {
        "names": ["desarrollo_si_participantes", "participantes del desarrollo de si", "participantes del desarrollo de sistemas de informacion"],
        "displayName": "Participantes del Desarrollo de SI",
        "definition": "Personas y roles clave que intervienen en las distintas fases del desarrollo de un sistema de información. <ul><li><b>Clientes o administradores:</b> Definen objetivos y proveen recursos.</li><li><b>Líder de proyecto:</b> Coordina, planifica y controla el desarrollo.</li><li><b>Analistas:</b> Identifican requerimientos funcionales, procesos y documentación.</li><li><b>Diseñadores:</b> Traducen modelos lógicos a soluciones técnicas.</li><li><b>Programadores:</b> Codifican el sistema.</li><li><b>Testers:</b> Verifican que el sistema cumpla con los requerimientos.</li><li><b>Entrenadores:</b> Capacitan a los usuarios finales.</li></ul> Ver también [[desarrollo_si|Desarrollo de SI]]."
      },
      {
        "names": ["erp", "enterprise resource planning", "sistemas erp"],
        "displayName": "ERP",
        "definition": "<b>Enterprise Resource Planning</b> (ERP) - Sistema de información integrado que permite automatizar, coordinar y gestionar todos los procesos de negocio de una organización en una única plataforma, compartiendo una base de datos central. <ul><li><b>Características:</b> <ul><li>Sistema integrado: Todos los módulos comparten una base de datos única.</li><li>Basado en mejores prácticas: Procesos eficientes probados en otras organizaciones.</li><li>Modularidad: Compuesto por módulos funcionales (RRHH, finanzas, logística, etc.).</li><li>Personalización limitada: Adaptable parcialmente mediante configuraciones o sistemas externos.</li><li>Visión orientada a procesos: Centrado en la cadena de valor y el cliente.</li></ul></li><li><b>Objetivos:</b> <ul><li>Eliminar fragmentación de datos.</li><li>Integrar procesos y departamentos.</li><li>Mejorar la toma de decisiones.</li><li>Modernizar la infraestructura tecnológica.</li></ul></li><li><b>Ventajas:</b> <ul><li>Acceso rápido a información en tiempo real.</li><li>Mejora de la eficiencia operativa.</li><li>Integración de todas las áreas de la empresa.</li><li>Reducción de redundancia de datos.</li><li>Mejores prácticas ya incorporadas.</li><li>Escalabilidad con módulos según necesidad.</li></ul></li><li><b>Desventajas:</b> <ul><li>Alto costo y complejidad de implementación.</li><li>Necesidad de reorganizar procesos internos.</li><li>Dependencia del proveedor.</li><li>Posibles desequilibrios en el desarrollo de áreas.</li><li>Capacitación intensiva requerida.</li></ul></li><li><b>Factores críticos de éxito:</b> <ul><li>Apoyo de la alta dirección.</li><li>Enfoque estratégico y organizacional, no solo tecnológico.</li><li>Gestión adecuada del cambio.</li><li>Capacitación y soporte continuo al personal.</li></ul></li></ul> Ver también [[si|Sistema de Información]], [[tps|TPS]]."
      },
      {
        "names": ["scm", "supply chain management", "gestión de la cadena de abastecimiento"],
        "displayName": "SCM",
        "definition": "<p>La <strong>cadena de abastecimiento</strong> (Supply Chain) es una red compleja de relaciones y procesos mediante la cual las empresas adquieren insumos, transforman productos y los entregan al cliente final. Incluye proveedores, procesos de producción, almacenamiento, distribución y clientes, abarcando todas las actividades necesarias para llevar un producto desde su origen hasta el consumidor.</p><p>La <strong>gestión de la cadena de abastecimiento (SCM)</strong> tiene como objetivo optimizar estos procesos de manera integral, desde la compra de materias primas hasta la entrega del producto final, buscando <strong>eficiencia, reducción de costos y satisfacción del cliente</strong>.</p><h4><strong>Componentes Clave de un Sistema SCM</strong></h4><ol><li><strong>Planificación de la demanda y distribución</strong>.</li><li><strong>Programación de la producción</strong>.</li><li><strong>Gestión de rutas logísticas y envíos</strong>.</li><li><strong>Administración de inventarios y almacenes</strong>.</li><li><strong>Diseño y coordinación logística física</strong>.</li></ol><h4><strong>Beneficios de implementar un SCM</strong></h4><ul><li>Disminución de costos de inventario y almacenaje.</li><li>Mejora en los ciclos de producción, compra y venta.</li><li>Reducción de ventas perdidas y desperdicios.</li><li>Incremento en la fidelización de clientes.</li><li>Participación competitiva en mercados globales.</li><li>Mayor eficiencia operativa y generación de nuevas alianzas comerciales.</li></ul><h4><strong>Actores Principales de la Cadena de Abastecimiento</strong></h4><ul><li><strong>Proveedores</strong>: suministran insumos y materiales, afectando directamente la calidad y puntualidad.</li><li><strong>Fabricantes</strong>: transforman insumos en productos terminados.</li><li><strong>Distribuidores</strong>: trasladan productos al mercado, influenciando la percepción de calidad.</li><li><strong>Clientes</strong>: son el eslabón final y principal objetivo de toda la cadena.</li></ul><h4><strong>Necesidades Básicas de Información en un SCM</strong></h4><ul><li>Información de <strong>proveedores</strong> (plazos, condiciones, calidad).</li><li>Información de <strong>producción</strong> (qué, cuánto, cuándo y cómo producir).</li><li>Información de <strong>distribución</strong> (rutas, medios, tiempos y costos).</li><li>Información de <strong>demanda</strong> (patrones de consumo, predicciones, ubicación de ventas).</li></ul><h4><strong>Relación entre ERP y SCM</strong></h4><ul><li>Un <strong>ERP</strong> (Enterprise Resource Planning) integra las operaciones internas de una empresa.</li><li>Un <strong>SCM</strong>, en cambio, <strong>extiende la gestión</strong> más allá de la empresa, abarcando relaciones con proveedores, distribuidores y clientes para optimizar toda la red de valor.</li></ul><h4><strong>Transformación organizacional mediante SCM</strong></h4><p>El SCM integra funciones tradicionalmente aisladas como compras, producción y logística, alineándolas con la estrategia global de la empresa y mejorando la toma de decisiones a partir de la disponibilidad de información en tiempo real, lo cual permite operar de forma más ágil, colaborativa y eficiente.</p>"
      }
    ]
  }
