{
    "terms": [
      {
        "names": ["si", "sistema de informacion", "sistemas de informacion"],
        "displayName": "SI",
        "definition": "<b>Sistema de Información</b> - Conjunto de elementos interrelacionados que recopilan, procesan, almacenan y distribuyen información para facilitar la toma de decisiones en las organizaciones. Puede ser manual o automatizado. <ul><li><b>Objetivo:</b> Apoyar la toma de decisiones.</li><li><b>Actividades:</b> Entrada, procesamiento, salida y retroalimentación de datos.</li><li><b>Recursos:</b> Tecnológicos, humanos, económicos, insumos, infraestructura y logísticos.</li><li><b>Ambiente:</b> Factores externos como clientes, regulaciones y otros sistemas.</li><li><b>Clasificación:</b> [[mis|MIS]], [[tps|TPS]], [[dss|DSS]].</li><li>Relacionado: [[desarrollo_si|Desarrollo de SI]]</li></ul>"
      },
      {
        "names": ["tps", "sistema transaccional", "sistemas transaccionales"],
        "displayName": "TPS",
        "definition": "<b>Sistemas Transaccionales</b> (Transaction Processing Systems) - Sistemas informáticos diseñados para registrar, procesar y almacenar las transacciones rutinarias de una organización. <ul><li><b>Enfoque:</b> Nivel operativo.</li><li><b>Funciones:</b> Registrar, almacenar y procesar transacciones básicas como ventas, compras y sueldos.</li><li><b>Características de las transacciones:</b> Operaciones individuales, breves e indivisibles con identificador único, fecha, hora, origen y ubicación.</li><li><b>Componentes:</b> Hardware, software, bases de datos, personal, telecomunicaciones y procedimientos operativos.</li><li><b>Objetivos:</b> Procesar grandes volúmenes de datos con precisión, asegurar integridad y calidad, reducir burocracia, generar informes, mejorar eficiencia del personal, y brindar soporte a sistemas como [[mis|MIS]], [[dss|DSS]], y ERP.</li><li><b>Pasos del procesamiento:</b> Captura de datos, validación, procesamiento, actualización de bases de datos, emisión de comprobantes.</li><li><b>Modos de procesamiento:</b> Por lotes, en línea, entrada en línea con procesamiento diferido.</li><li><b>Áreas funcionales:</b> Finanzas, ventas, logística, recursos humanos.</li><li><b>Ejemplos:</b> Procesamiento de pedidos y compras.</li></ul> Ver también [[si|Sistema de Información]]."
      },
      {
        "names": ["mis", "sistema de informacion gerencial", "sistemas de informacion gerencial"],
        "displayName": "MIS",
        "definition": "<b>Sistemas de Información Gerencial</b> - Brindan información estructurada y periódica para apoyar decisiones tácticas en mandos intermedios. <ul><li><b>Usuarios:</b> Mandos medios o gerenciales.</li><li><b>Objetivo:</b> <ul><li>Facilitar decisiones tácticas</li><li>apoyar la gestión eficiente de recursos</li><li>brindar retroalimentación sobre la operatoria diaria</li><li>proveer información consolidada y estructurada para la [[toma_decisiones|toma de decisiones]]</li><li>monitorear el cumplimiento de [[objetivos_organizacionales|objetivos organizacionales]].</li></ul></li><li><b>Entradas:</b><ul><li><b>Fuentes Internas</b> como [[tps|TPS]]</li><li><b>fuentes externas</b> como clientes, proveedores, accionistas y competencia.</li></ul></li><li><b>Salidas:</b><ul><li><b>Reportes calendarizados:</b> se producen de forma periódica (diarios, semanales, mensuales).</li><li><b>Reportes por indicador clave:</b> resumen de actividades críticas recientes.</li><li><b>Reportes a pedido:</b> generados a solicitud específica del usuario.</li><li><b>Reportes de excepción:</b> emitidos ante eventos o desviaciones inusuales.</li><li><b>Reportes drill-down:</b> permiten profundizar desde información general hasta el detalle específico.</li></ul><b>Características clave:</b> <ul><li>Integración de datos de múltiples fuentes</li><li>personalización de reportes según el perfil del usuario</li><li>soporte para decisiones tácticas y estratégicas</li><li>automatización y repetitividad en la generación de información.</li></ul></li><li><b>Importancia:</b> Permite análisis históricos, comparación de datos, análisis de tendencias y ajustes estratégicos, convirtiéndose en herramienta esencial para la <b>eficiencia operativa y el cumplimiento de metas organizacionales.</b></li><li>Ver también [[si|Sistema de Información]].</li></ul> "
      },
      {
        "names": ["dss", "sistema de apoyo a la toma de decisiones", "sistemas de apoyo a la toma de decisiones"],
        "displayName": "DSS",
        "definition": "<b>Sistema de Apoyo a la Toma de Decisiones</b> (Decision Support System) - Sistema interactivo basado en computadora que combina datos, modelos analíticos y herramientas para ayudar en decisiones complejas, especialmente no estructuradas. <ul><li><b>Componentes:</b> Base de datos, base de modelos, interfaz de usuario y tomador de decisiones.</li><li><b>Características:</b> Flexible, adaptable, permite simulaciones y análisis 'qué pasaría si', usa datos internos y externos, soporta minería de datos y algoritmos heurísticos.</li><li><b>Capacidades:</b> Apoya la resolución de problemas en fases de inteligencia, diseño, elección, implementación y monitoreo; soporta decisiones ad hoc e institucionales; y problemas estructurados y no estructurados a nivel operativo, táctico y estratégico.</li><li><b>Objetivos:</b> Apoyar el juicio humano, fomentar la creatividad y permitir la exploración libre de alternativas.</li><li>Soporte para Multiple Niveles Organizacionales<ul><li>Operativos: Decisiones Diarias</li><li>Tactico: Planificacion y control</li><li>Estrategico: Decisiones de largo plazo</li></ul></li><li>Ver también [[si|Sistema de Información]], [[mis|MIS]], [[tps|TPS]].</li></ul>"
      }
    ]
  }
  